"""
Напишете програма, с която да помогнете на Людмила да изчисли какъв бюджет ще ѝ бъде необходим, като имате следната информация за допълнителните неща, необходими за тържеството:
•	Торта  – цената ѝ е 20% от наема на залата
•	Напитки – цената им е 45% по-малко от тази на тортата
•	Аниматор – цената му е 1/3 от цената за наема на залата
Вход
От конзолата се четe 1 ред:
•	Наем за залата – цяло число
Изход
Да се отпечата на конзолата какъв бюджет ще бъде необходим за организиране на тържеството

Вход	Изход
2250	3697.5
3720	6113.2


"""

def birthday_budget(rent, cake_p, drinks_p):
    cake = rent * cake_p / 100
    drinks = cake - cake * drinks_p / 100
    animator = rent / 3

    print(rent + cake + drinks + animator)


room_rent = int(input())
cake_percentage = 20
drinks_percentage = 45

birthday_budget(room_rent, cake_percentage, drinks_percentage)
